import React from 'react';

const Ozon = () => (
  <div>
      I&apos;m developing CRM for supports team, which separate on few modules:
      — Chats
      — Calls
      — Social Networks

      And many others useful channels, which Ozon uses to take a feedback.s
    Занимаюсь разработкой CRM для операторов службы поддержки, которая состоит из разных модулей:
    — Чаты
    — Звонки
    — Соц.сети

    И много других полезных каналов, через которые ОЗОН собирает фидбэк со своих клиентов.

    Пришел в компанию на момент совершенствования CRM, когда она уже прекрасно работала, но даже на тот момент она была так себе.

    Я работаю со стэком (2019) 🛠:
    — React/Redux (Redux стараемся выпилить, так как особой необходимости в нем нет, но покровители святого боженьки Дэна будут не согласны)

    UPD22: Redux не выпилили, а сохранили в нем очень важные данные для работы, в остальных случаях используем Context.

    — Formik (поскольку очень много форм)

    UPD22: Formik все также спасает, лучшего пакета для форм не встречал

    — GraphQL

    UPD22: Я даже делал доклад по GraphQL, но внутри команды.

    — Typescript (как раз идет процесс переписывания многих частей на него, поскольку в связке с GraphQL жизнь становится лучше).

    UPD22: TS - это наше всё

    2022:
    Много работал с библиотекой DnD (пробовал 2), немного приобрел опыта по работе с Canvas (GoJS) и немного Vue (2)
  </div>
);

export default Ozon;
